import { BossRuleProps, BossRuleFaqProps } from '@/types/(app)';
import { FaCheckCircle, FaTrophy, FaUsers } from 'react-icons/fa';

export const bossRuleData: BossRuleProps[] = [
    {
        title: 'การจองไอเทม',
        icon: <FaCheckCircle className='w-6 h-6 text-green-400' />,
        description: 'สมาชิกมีสิทธิ์จองไอเทม 1 ชิ้นจากบอสใดก็ได้ เมื่อได้รับแล้วต้องต่อคิวใหม่ (จองผ่านดิสคอร์ด)'
    },
    {
        title: 'สิทธิ์เลือกบอส',
        icon: <FaTrophy className='w-6 h-6 text-yellow-400' />,
        description: 'ผู้ที่มีแต้มส่วนร่วมสูงสุดจะได้สิทธิ์เลือกบอสที่ต้องการตี (7 คน)'
    },
    {
        title: 'เงื่อนไขรับไอเทม',
        icon: <FaUsers className='w-6 h-6 text-blue-400' />,
        description: 'ผู้เข้าร่วมตีบอสต้องมีแต้มส่วนร่วม 4,000+ หรือไม่เข้าร่วมแต่มีแต้ม 6,000+ จึงมีสิทธิ์รับไอเทม'
    }
];

export const bossRuleFaqData: BossRuleFaqProps[] = [
    {
        question: 'จำนวนบอสที่ตีแต่ละวัน?',
        answer: 'เสาร์ (3 ตัว), อาทิตย์ (4 ตัว)'
    },
    {
        question: 'เงื่อนไขการรับไอเทมหากไม่ได้เข้าร่วม?',
        answer: 'สำหรับคนที่ไม่มาตีบอสในวันที่ของดรอป ต้องมีแต้มส่วนร่วม 6,000 ขึ้นไป (ถ้าไม่ถึงของจะถูกส่งในคิวถัดไป / แต่คุณจะยังเป็นหัวคิวเหมือนเดิม)'
    },
    {
        question: 'อยากเลือกบอสกิลด์ ที่ฉันต้องการจะตี ทำยังไง?',
        answer: 'เก็บคะแนนส่วนร่วมกิลด์ให้ติดอันดับแรก ๆ ประจำสัปดาห์'
    },
    {
        question: 'สามารถจองไอเทมจากบอสคนละตัวได้หรือไม่?',
        answer: 'ไม่ได้ สามารถจองได้เพียง 1 ชิ้นเท่านั้น'
    },
    {
        question: 'เลือกของบอส 2 ชิ้น แต่ดรอปจากบอสคนละตัวได้มั้ย?',
        answer: 'ไม่ได้ เลือกได้แค่ชิ้นเดียวเท่านั้น'
    },
    {
        question: 'ถ้าจองของชิ้นเดียวกันหลาย ๆ คน จะไม่รอคิวนานเกินไปหรอ?',
        answer: 'นาน หากไม่ดรอปเลย แต่อย่าลืมว่า หากมีคนต้องการเยอะ แปลว่าจะมีคนเลือกบอสตัวนั้นเยอะด้วยเช่นกัน (Demand & Supply)'
    }
];